/*******************************************************************************
* osa_sem.h
*
* Copyright (C) 2011-2013 ZheJiang Dahua Technology CO.,LTD.
*
* Author : Zheng wei <zheng_wei@dahuatech.com>
* Version: V1.0.0  2012-5-23 Create
*
* Desc: 定义OSA模块对外提供的信号量接口
*
*           接口调用流程如下:
*           ==========================
*                   |                            
*           OSA_semCreate
*                   |
*           OSA_semPend/OSA_semPost
*                   |
*           OSA_semDelete
*           ===========================
*
* Modification: 
*    Date    :  
*    Revision:
*    Author  :
*    Contents:
*******************************************************************************/


#ifndef _OSA_SEM_H_
#define _OSA_SEM_H_


/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */

#ifdef __cplusplus
extern "C" {
#endif


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */
/* 调用OSA_semCreate返回的信号量句柄类型,上层模块不需要关心其中的具体内容,*/
/* 只需要在各信号量操作接口中传入该句柄即可*/
typedef Handle OSA_SemHandle;

/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */

/*******************************************************************************
* 函数名  : OSA_semCreate
* 描  述  : 该函数负责创建一个信号量
*           该接口不能在中断上下文调用
*
* 输  入  : - val:      信号量的初始值
*
* 输  出  : - phSem:    信号量 句柄指针,当创建成功时输出信号量句柄
* 返回值  :  OSA_SOK:   创建成功
*            OSA_EFAIL: 创建失败
*******************************************************************************/
Int32 OSA_semCreate(Uint32 val, OSA_SemHandle *phSem);

/*******************************************************************************
* 函数名  : OSA_semPend
* 描  述  : 信号量获取操作,
*           该接口不能在中断上下文调用
*
* 输  入  : - hSem:     信号量句柄,
*           - timeOut:  信号量等待超时时间, 单位毫秒，若等待超时则返回OSA_ETIMEOUT
*                       OSA_TIMEOUT_NONE表示不等待信号量立即返回，
*                               此时若能获取到信号量则返回OSA_SOK
*                               若不能获取信号量则返回OSA_EFAIL
*                       OSA_TIMEOUT_FOREVER表示永远等待信号量
*
* 输  出  : 无
* 返回值  :  OSA_SOK:   获取信号量成功
*            OSA_EFAIL: 获取信号量失败
*            OSA_ETIMEOUT: 获取信号量超时
*******************************************************************************/
Int32 OSA_semPend(OSA_SemHandle hSem, Uint32 timeOut);

/*******************************************************************************
* 函数名  : OSA_semPost
* 描  述  : 信号量释放操作
*           该接口可以在中断上下文调用
*
* 输  入  : - hSem:   信号量句柄,
*
* 输  出  : 无。
* 返回值  : OSA_SOK:   成功
*           OSA_EFAIL: 失败
*******************************************************************************/
Int32 OSA_semPost(OSA_SemHandle hSem);


/*******************************************************************************
* 函数名  : OSA_semPostWhenEmpty
* 描  述  : 信号量置1操作
*           多次调用该接口，信号号的个数始终为1
* 输  入  : - hSem:
* 输  出  : 无
* 返回值  : OSA_SOK  : 成功
*           OSA_EFAIL: 失败
*******************************************************************************/
Int32 OSA_semPostWhenEmpty(OSA_SemHandle hSem);



/*******************************************************************************
* 函数名  : OSA_semGetCnt
* 描  述  : 获取信号量的个数
* 输  入  : - hSem: 信号量句柄
* 输  出  : - pCnt: 信号量的个数
* 返回值  : OSA_SOK  : 成功
*           OSA_EFAIL: 失败
*******************************************************************************/
Int32 OSA_semGetCnt(OSA_SemHandle hSem,Uint32 *pCnt);



/*******************************************************************************
* 函数名  : OSA_semDelete
* 描  述  : 该函数负责销毁一个信号量
*           该接口不能在中断上下文调用
*
* 输  入  : - hSem: 信号量句柄,
*
* 输  出  : 无。
* 返回值  : OSA_SOK:   成功
*           OSA_EFAIL: 失败
*******************************************************************************/
Int32 OSA_semDelete(OSA_SemHandle hSem);


#ifdef __cplusplus
}
#endif

#endif  /*  _OSA_SEM_H_  */


