/*******************************************************************************
 * osa_ut.h
 *
 * Copyright (C) 2011-2013 ZheJiang Dahua Technology CO.,LTD.
 *
 * Author : Zheng Wei <zheng_wei@dahuatech.com>
 * Version: V1.0.0  2013年9月12日 Create
 *
 * Description: 
 *
 *       1. 硬件说明
 *          无。
 *
 *       2. 程序结构说明。
 *          无。
 *
 *       3. 使用说明。
 *          无。
 *
 *       4. 局限性说明。
 *          无。
 *
 *       5. 其他说明。
 *          无。
 *
 * Modification: 
 *    Date     : 
 *    Revision :
 *    Author   :
 *    Contents :
 *******************************************************************************/



#ifndef _OSA_UT_H_
#define _OSA_UT_H_


/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */


#ifdef __cplusplus
extern "C"{
#endif /* __cplusplus */


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */

/* osa初始化相关接口用例 */
void OSA_utInitSuit(void);

/* osa内存相关接口用例 */
void OSA_utMemSuit(void);

/* osa互斥锁相关接口用例 */
void OSA_utMutexSuit(void);

/* osa信号量相关接口用例 */
void OSA_utSemSuit(void);

/* osa队列相关接口用例 */
void OSA_utQueSuit(void);

/* osa任务相关接口用例 */
void OSA_utTskSuit(void);





#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif

